{
  "areas": [
    {
      "title": "Heterogeneous Graph Machine Learning",
      "description": "Geometric machine learning - or graph machine learning (GraphML) - is a branch of machine learning that discovers patterns in graph-formatted (network) data structures, and uses those patterns to make intelligent decisions on future data.",
      "image": "/images/research/area1.png",
      "publications": [
        "Romano, Joseph D., Yun Hao, and Jason H. Moore. \"Improving QSAR modeling for predictive toxicology using publicly aggregated semantic graph data and graph neural networks.\" Pacific Symposium on Biocomputing. Pacific Symposium on Biocomputing. Vol. 27. 2022.",
        "Romano, Joseph D., et al. \"The Alzheimer’s knowledge base: a knowledge graph for Alzheimer disease research.\" Journal of Medical Internet Research 26 (2024): e46777."
      ]
    },
    {
      "title": "Computational Toxicology",
      "description": "Computational toxicology is a field that uses computational models to predict and explain the toxic effects of specific chemical compounds on humans and ecosystems. For decades, this has been done almost entirely using a small set of techniques (like quantitative structure-activity relationship (QSAR) modeling), but recent advances in machine learning and knowledge graph construction have opened up new possibilities. We are particularly interested in using structured biomedical knowledge (e.g., Adverse Outcome Pathways) and emerging AI methods (e.g., graph neural networks) to improve the accuracy and explainability of predictive toxicology.",
      "image": "/images/research/area2.jpg",
      "publications": [
        "Romano, Joseph D., et al. \"Automating predictive toxicology using ComptoxAI.\" Chemical research in toxicology 35.8 (2022): 1370-1382.",
        "Hao, Yun, et al. \"Knowledge graph aids comprehensive explanation of drug and chemical toxicity.\" CPT: Pharmacometrics & Systems Pharmacology 12.8 (2023): 1072-1079."
      ]
    }
  ],
  "funding": [
    {
      "agency": "NSF",
      "title": "SCH: An intraoral device for multimodal data integration and risk modification connects the oral microbiome to systemic health",
      "awardNumber": "2500339",
      "years": "2025-2029",
      "url": "https://www.nsf.gov/awardsearch/showAward?AWD_ID=2500339"
    },
    {
      "agency": "NIH/NLM",
      "title": "Discovering clinical endpoints of toxicity via graph machine learning and semantic data analysis",
      "awardNumber": "K99/R00-LM013646",
      "years": "2021-2025",
      "url": "https://reporter.nih.gov/project-details/11000821"
    }
  ],
  "pastFunding": [
    {
      "agency": "Colton Institute for Autoimmunity",
      "title": "Biomarker discovery for early prediction of autoimmunity in immunotherapy patients through deep immune profiling and temporal graph convolutional networks",
      "years": "2023-2025"
    }
  ]
}